model.add(Conv1D(128,6,input_shape=[288,1],activation='relu'))
model.add(MaxPooling1D(pool_size=2))
model.add(Conv1D(128,6,activation='relu'))
model.add(MaxPooling1D(pool_size=2))
model.add(Flatten())
model.add(Dense(5,activation='softmax'))



Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 283, 128)          896       
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 141, 128)          0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 136, 128)          98432     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 68, 128)           0         
_________________________________________________________________
flatten (Flatten)            (None, 8704)              0         
_________________________________________________________________
dense (Dense)                (None, 5)                 43525     
=================================================================
Total params: 142,853
Trainable params: 142,853
Non-trainable params: 0
_________________________________________________________________